/*
 * Copyright (c) 2021 MediaTek Inc.
 *
 * Use of this source code is governed by a MIT-style
 * license that can be found in the LICENSE file or at
 * https://opensource.org/licenses/MIT
 */

#include <debug.h>
#include <platform/pll.h>
#include <platform/reg.h>

struct mtk_mcucfg_regs {
    uint32_t reserved1[168];
    uint32_t cpu_plldiv_cfg0;   /* 0x02a0 */
    uint32_t cpu_plldiv_cfg1;
    uint32_t reserved2[14];
    uint32_t bus_plldiv_cfg;    /* 0x02e0 */
};
STATIC_ASSERT(__offsetof(struct mtk_mcucfg_regs, cpu_plldiv_cfg0) == 0x02a0);
STATIC_ASSERT(__offsetof(struct mtk_mcucfg_regs, bus_plldiv_cfg) == 0x02e0);
static struct mtk_mcucfg_regs *const mcucfg = (void *)(MCUCFG_BASE + 0x0000a000);

struct mtk_infracfg_ao_regs {
    uint32_t reserved1[28];
    uint32_t infra_bus_dcm_ctrl;    /* 0x0070 */
    uint32_t reserved2[4];
    uint32_t module_sw_cg_0_clr;    /* 0x0084 */
    uint32_t reserved3[1];
    uint32_t module_sw_cg_1_clr;    /* 0x008c */
    uint32_t reserved4[6];
    uint32_t module_sw_cg_2_clr;    /* 0x00a8 */
    uint32_t reserved5[6];
    uint32_t module_sw_cg_3_clr;    /* 0x00c4 */
    uint32_t reserved6[7];
    uint32_t module_sw_cg_4_clr;    /* 0x00e4 */
};
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_regs, infra_bus_dcm_ctrl) == 0x0070);
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_regs, module_sw_cg_0_clr) == 0x0084);
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_regs, module_sw_cg_2_clr) == 0x00a8);
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_regs, module_sw_cg_3_clr) == 0x00c4);
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_regs, module_sw_cg_4_clr) == 0x00e4);
static struct mtk_infracfg_ao_regs *const infracfg_ao = (void *)INFRACFG_AO_BASE;

struct mtk_infracfg_ao_bcrm_regs {
    uint32_t reserved1[13];
    uint32_t vdnr_dcm_top_infra_ctrl0;    /* 0x0034 */
};
STATIC_ASSERT(__offsetof(struct mtk_infracfg_ao_bcrm_regs, vdnr_dcm_top_infra_ctrl0) == 0x0034);
static struct mtk_infracfg_ao_bcrm_regs *const infracfg_ao_bcrm = (void *)(IO_BASE + 0x00022000);

struct mtk_spm_regs {
    uint32_t reserved1[271];
    uint32_t ap_mdsrc_req;    /* 0x043c */
};
STATIC_ASSERT(__offsetof(struct mtk_spm_regs, ap_mdsrc_req) == 0x043c);
static struct mtk_spm_regs *const spm = (void *)SPM_BASE;

struct mtk_pericfg_ao_regs {
    u32 reserved1[4];
    u32 peri_module_sw_cg_0_set;    /* 0x0010 */
};
STATIC_ASSERT(__offsetof(struct mtk_pericfg_ao_regs, peri_module_sw_cg_0_set) == 0x0010);
static struct mtk_pericfg_ao_regs *const pericfg_ao = (void *)PERICFG_AO_BASE;

enum mux_id {
    TOP_AXI_SEL,
    TOP_SPM_SEL,
    TOP_SCP_SEL,
    TOP_BUS_AXIMEM_SEL,
    TOP_VPP_SEL,
    TOP_ETHDR_SEL,
    TOP_IPE_SEL,
    TOP_CAM_SEL,
    TOP_CCU_SEL,
    TOP_IMG_SEL,
    TOP_CAMTM_SEL,
    TOP_DSP_SEL,
    TOP_DSP1_SEL,
    TOP_DSP2_SEL,
    TOP_DSP3_SEL,
    TOP_DSP4_SEL,
    TOP_DSP5_SEL,
    TOP_DSP6_SEL,
    TOP_DSP7_SEL,
    TOP_IPU_IF_SEL,
    TOP_MFG_SEL,
    TOP_CAMTG_SEL,
    TOP_CAMTG2_SEL,
    TOP_CAMTG3_SEL,
    TOP_CAMTG4_SEL,
    TOP_CAMTG5_SEL,
    TOP_UART_SEL,
    TOP_SPI_SEL,
    TOP_SPIS_SEL,
    TOP_MSDC50_0_H_SEL,
    TOP_MSDC50_0_SEL,
    TOP_MSDC30_1_SEL,
    TOP_MSDC30_2_SEL,
    TOP_INTDIR_SEL,
    TOP_AUD_INTBUS_SEL,
    TOP_AUDIO_H_SEL,
    TOP_PWRAP_ULPOSC_SEL,
    TOP_ATB_SEL,
    TOP_PWRMCU_SEL,
    TOP_DP_SEL,
